# Dotfiles dependencies for macOS
# Install with: brew bundle
# Note: Neovim is managed via bob, not Homebrew

# Core tools
brew "stow"
brew "fish"
brew "bob"         # Neovim version manager

# Shell enhancements
brew "oh-my-posh"
brew "zoxide"
brew "fzf"
brew "vivid"       # LS_COLORS generator

# CLI tools
brew "yazi"
brew "fastfetch"
brew "lazygit"
brew "lazydocker"
brew "fd"
brew "ripgrep"
brew "bat"
brew "eza"

# Version managers
brew "asdf"

# Languages & runtimes
brew "python@3.12"
brew "node"

# Window management (macOS specific)
brew "koekeishiya/formulae/yabai"
brew "koekeishiya/formulae/skhd"
tap "FelixKratz/formulae"
brew "sketchybar"
cask "nikitabobko/tap/aerospace"

# Terminal
cask "wezterm"

# Development
cask "orbstack"     # Docker alternative

# Optional: Uncomment if you use these
# cask "herd"       # Laravel Herd
# brew "bun"
# brew "pnpm"
